admin_panel/ADMIN_STOCK_PRICE_EDITING_DELECTION_TESTING/admin_Stock_price_editing _DELECTION_testing-Combined-JMeter-and-Selenium.yaml
---
# Script generated by Blazemeter Chrome Extension

modules:
  nose:
    ignore-unknown-actions: true

execution:
- executor: selenium
  scenario: admin_Stock_price_editing _DELECTION_testing-Selenium
  hold-for: 20m

- executor: jmeter
  scenario: admin_Stock_price_editing _DELECTION_testing-Http
  concurrency: 20
  ramp-up: 1m
  hold-for: 19m

scenarios:
  admin_Stock_price_editing _DELECTION_testing-Selenium:
    browser: Chrome  # available browsers are: ["Firefox", "Chrome", "Ie", "Opera"]
    headless: false
    timeout: 60s
    think-time: 0s
    requests:
    - label: Test
      actions:
      - go(http://localhost:33143/Administator/StockPriceTable)
      - clickByXPath(//table[@id='stock']/tbody/tr/td[4]/button)
      - clickByLinkText(Edit)
      - clickByID(Stock_Name)
      - typeByID(Stock_Name): "GOLTEN"
      - typeByID(Buying): "5544"
      - typeByID(Selling): "2369"
      - clickByCSS(input.btn.btn-primary)
      # WARN: Command Not yet supported. ('chooseOkOnNextConfirmation:"":""')
      - clickByCSS(button.btn.btn-primary.delete-stock)
      # WARN: Command Not yet supported. ('assertConfirmation:"You really want to Delete?":""')

  admin_Stock_price_editing _DELECTION_testing-Http:
    headers:
      User-Agent: 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/71.0.3578.98 Safari/537.36'
      Accept-Encoding: 'gzip, deflate, br'
      Accept-Language: 'en-US,en;q=0.9'
    requests:
      - transaction: Test
        force-parent-sample: false
        do:
          - url: 'http://localhost:33143/Administator/StockEdit/10'
            method: GET
            label: 'http://localhost:33143/Administator/StockEdit/10'
            think-time: 0ms
            headers:
              Upgrade-Insecure-Requests: '1'
              Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8'
              Referer: 'http://localhost:33143/Administator/StockPriceTable'
          - url: 'http://localhost:45157/6639822e5924419d907fe0f7a5fe5d63/arterySignalR/abort?transport=webSockets&connectionToken=AQAAANCMnd8BFdERjHoAwE%2FCl%2BsBAAAAxjzWcLo0lUGw9PxkRdhOIgAAAAACAAAAAAAQZgAAAAEAACAAAAAowf9fahghUojnHeOZ6OmU4FkL4dnF5tpS0jYG4G7zqwAAAAAOgAAAAAIAACAAAABmR%2BOAQqqxvjUJmocUKXMYPNzuzvrTn0MfW8TRcn4qcTAAAADKCBZb5nWsDOQgwR%2BZv861UPRBZX6fNdY6NQ%2FM9DQXqhDsbPZPTYFCH16zHEB%2FiLhAAAAA0iwhb3CMLFm5Lyt5JTsPYLBzHZvE6SbXnCOEdHzLpTM8%2B0eS06czRm%2B9hzSrf4F4XGJdtjwacuN6XTtfGZ2y%2BQ%3D%3D&requestUrl=http%3A%2F%2Flocalhost%3A33143%2FAdministator%2FStockPriceTable&browserName=Chrome'
            method: POST
            label: 'http://localhost:45157/6639822e5924419d907fe0f7a5fe5d63/arterySignalR/abort?transport=webSockets&connectionToken=AQAAANCMnd8BFdERjHoAwE%2FCl%2BsBAAAAxjzWcLo0lUGw9PxkRdhOIgAAAAACAAAAAAAQZgAAAAEAACAAAAAowf9fahghUojnHeOZ6OmU4FkL4dnF5tpS0jYG4G7zqwAAAAAOgAAAAAIAACAAAABmR%2BOAQqqxvjUJmocUKXMYPNzuzvrTn0MfW8TRcn4qcTAAAADKCBZb5nWsDOQgwR%2BZv861UPRBZX6fNdY6NQ%2FM9DQXqhDsbPZPTYFCH16zHEB%2FiLhAAAAA0iwhb3CMLFm5Lyt5JTsPYLBzHZvE6SbXnCOEdHzLpTM8%2B0eS06czRm%2B9hzSrf4F4XGJdtjwacuN6XTtfGZ2y%2BQ%3D%3D&requestUrl=http%3A%2F%2Flocalhost%3A33143%2FAdministator%2FStockPriceTable&browserName=Chrome'
            headers:
              Accept: 'text/plain, */*; q=0.01'
              Origin: 'http://localhost:33143'
              Content-Type: application/x-www-form-urlencoded; charset=UTF-8
              Referer: 'http://localhost:33143/Administator/StockPriceTable'
          - url: 'http://localhost:45157/6639822e5924419d907fe0f7a5fe5d63/arterySignalR/negotiate'
            method: GET
            label: 'http://localhost:45157/6639822e5924419d907fe0f7a5fe5d63/arterySignalR/negotiate'
            headers:
              Accept: 'text/plain, */*; q=0.01'
              Origin: 'http://localhost:33143'
              Content-Type: application/x-www-form-urlencoded; charset=UTF-8
              Referer: 'http://localhost:33143/Administator/StockEdit/10'
            body:
              requestUrl: 'http://localhost:33143/Administator/StockEdit/10'
              browserName: Chrome
              clientProtocol: '1.3'
              _: '1546070583946'
          - url: 'http://localhost:33143/__browserLink/requestData/74d4f3650adc43cc8cf9df3da478c2ec'
            method: GET
            label: 'http://localhost:33143/__browserLink/requestData/74d4f3650adc43cc8cf9df3da478c2ec'
            headers:
              Accept: 'application/json, text/javascript, */*; q=0.01'
              X-Requested-With: XMLHttpRequest
              Referer: 'http://localhost:33143/Administator/StockEdit/10'
          - url: 'http://localhost:33143/Administator/StockDBEdit'
            method: POST
            label: 'http://localhost:33143/Administator/StockDBEdit'
            think-time: 16681ms
            headers:
              Origin: 'http://localhost:33143'
              Upgrade-Insecure-Requests: '1'
              Content-Type: application/x-www-form-urlencoded
              Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8'
              Referer: 'http://localhost:33143/Administator/StockEdit/10'
            body:
              Buying: '5544'
              Selling: '2369'
              Stock_ID: '10'
              Stock_Name: GOLTEN
              __RequestVerificationToken: 0f7nRs0eAYzB8TIoBKeVS4fYgRgC7Nn-7DPZobRR4P3WmtjObgrGO_8gLpXFxr_vDwDZ04eZy7z0kSkAYJKid5PvH570BmMfiGltqMMDkF41
          - url: 'http://localhost:33143/Administator/StockPriceTable'
            method: GET
            label: 'http://localhost:33143/Administator/StockPriceTable'
            think-time: 20ms
            headers:
              Upgrade-Insecure-Requests: '1'
              Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8'
              Referer: 'http://localhost:33143/Administator/StockEdit/10'
          - url: 'http://localhost:45157/6639822e5924419d907fe0f7a5fe5d63/arterySignalR/abort?transport=webSockets&connectionToken=AQAAANCMnd8BFdERjHoAwE%2FCl%2BsBAAAAxjzWcLo0lUGw9PxkRdhOIgAAAAACAAAAAAAQZgAAAAEAACAAAAApTU%2FdqYqhKx257KivIhVnwLLHk%2BYtIYd60SFwQ2KLCAAAAAAOgAAAAAIAACAAAACdSyu%2FjQk%2F4mPbL7TEFvMs%2BmJBJ4LJ9k%2BscqR%2F8YWZKDAAAACpxWJiUC8vWWvbwkcWbzfv2Z2k6oq%2FQud0nAtBDIy1YTaeYK6UvDj0o3JjOfM3B3FAAAAAZDbsISlsW9n05CzPcKmN5JDIAVZrx1xB1inu%2FzuxGMKTlPoWdmqM0iKHvSNLjeUgfODc9FMsGIfJ5isMjWk0%2BA%3D%3D&requestUrl=http%3A%2F%2Flocalhost%3A33143%2FAdministator%2FStockEdit%2F10&browserName=Chrome'
            method: POST
            label: 'http://localhost:45157/6639822e5924419d907fe0f7a5fe5d63/arterySignalR/abort?transport=webSockets&connectionToken=AQAAANCMnd8BFdERjHoAwE%2FCl%2BsBAAAAxjzWcLo0lUGw9PxkRdhOIgAAAAACAAAAAAAQZgAAAAEAACAAAAApTU%2FdqYqhKx257KivIhVnwLLHk%2BYtIYd60SFwQ2KLCAAAAAAOgAAAAAIAACAAAACdSyu%2FjQk%2F4mPbL7TEFvMs%2BmJBJ4LJ9k%2BscqR%2F8YWZKDAAAACpxWJiUC8vWWvbwkcWbzfv2Z2k6oq%2FQud0nAtBDIy1YTaeYK6UvDj0o3JjOfM3B3FAAAAAZDbsISlsW9n05CzPcKmN5JDIAVZrx1xB1inu%2FzuxGMKTlPoWdmqM0iKHvSNLjeUgfODc9FMsGIfJ5isMjWk0%2BA%3D%3D&requestUrl=http%3A%2F%2Flocalhost%3A33143%2FAdministator%2FStockEdit%2F10&browserName=Chrome'
            headers:
              Accept: 'text/plain, */*; q=0.01'
              Origin: 'http://localhost:33143'
              Content-Type: application/x-www-form-urlencoded; charset=UTF-8
              Referer: 'http://localhost:33143/Administator/StockEdit/10'
          - url: 'http://localhost:45157/6639822e5924419d907fe0f7a5fe5d63/arterySignalR/negotiate'
            method: GET
            label: 'http://localhost:45157/6639822e5924419d907fe0f7a5fe5d63/arterySignalR/negotiate'
            headers:
              Accept: 'text/plain, */*; q=0.01'
              Origin: 'http://localhost:33143'
              Content-Type: application/x-www-form-urlencoded; charset=UTF-8
              Referer: 'http://localhost:33143/Administator/StockPriceTable'
            body:
              requestUrl: 'http://localhost:33143/Administator/StockPriceTable'
              browserName: Chrome
              clientProtocol: '1.3'
              _: '1546070601799'
          - url: 'http://localhost:33143/__browserLink/requestData/f1681be699654f91bca3e0163270087d'
            method: GET
            label: 'http://localhost:33143/__browserLink/requestData/f1681be699654f91bca3e0163270087d'
            headers:
              Accept: 'application/json, text/javascript, */*; q=0.01'
              X-Requested-With: XMLHttpRequest
              Referer: 'http://localhost:33143/Administator/StockPriceTable'
          - url: 'http://localhost:33143/Administator/StockDelete/10'
            method: GET
            label: 'http://localhost:33143/Administator/StockDelete/10'
            headers:
              Accept: '*/*'
              X-Requested-With: XMLHttpRequest
              Referer: 'http://localhost:33143/Administator/StockPriceTable'